---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ViewSheet..::..Duplicate Method
ViewSheet Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Duplicate(SheetDuplicateOption) | Duplicates this sheet to generate a new one. |
|  | Duplicate(ViewDuplicateOption) | Duplicates this view.  (Inherited from View.) |

# See Also

ViewSheet Class

ViewSheet Members

Autodesk.Revit.DB Namespace